dhzl84/ESP8266-Smart-Home/src/main.cpp
  /*= KEY ======================================||= VALUE ================================*/
  webpageTableAppend(String("Name"),              String(myConfig.name));
  webpageTableAppend(String("Chip ID"),           String(ESP.getChipId(), HEX));
  webpageTableAppend(String("IPv4"),              IPaddress);
  webpageTableAppend(String("FW version"),        String(FW));
  if (myConfig.inputMethod == cROTARY_ENCODER) {
    webpageTableAppend(String("Input Method"),      String("Rotary Encoder"));
  } else {
    webpageTableAppend(String("Input Method"),      String("Push Buttons"));
  }
  webpageTableAppend(String("Arduino Core"),      ESP.getCoreVersion());
  webpageTableAppend(String("Reset Reason"),      ESP.getResetReason());
  webpageTableAppend(String("Time since Reset"),  String(millisFormatted()));
  webpageTableAppend(String("Flash Size"),        String(ESP.getFlashChipRealSize()));
  webpageTableAppend(String("Sketch Size"),       String(ESP.getSketchSize()));
  webpageTableAppend(String("Free for Sketch"),   String(ESP.getFreeSketchSpace()));
  webpageTableAppend(String("Free Heap"),         String(ESP.getFreeHeap()));
  webpageTableAppend(String("Vcc"),               String(ESP.getVcc()/1000.0));
  webpageTableAppend(String("WiFi Status"),       wifiStatusToString(WiFi.status()));
  webpageTableAppend(String("WiFi Strength"),     String(rssiInPercent, 0) + " %");
  webpageTableAppend(String("WiFi Connects"),     String(WiFiConnectCounter));
  webpageTableAppend(String("MQTT Status"),       String((myMqttClient.connected()) == true ? "connected" : "disconnected"));
  webpageTableAppend(String("MQTT Connects"),     String(MQTTConnectCounter));
  webpage +="</table>";
  /* Change Name */
  webpage +="<p><b>Change Name</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<input type='text' name='newName' value="+ String(myConfig.name) + ">&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";
  /* Change Update Server */
  webpage +="<p><b>Change Update Server</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<input type='text' name='updServer' value="+ String(myConfig.updServer) + ">&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";
  /* Change Input Method */
  webpage +="<p><b>Change Input Method</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<select name='InputMethod'> ";
  if (myConfig.inputMethod == cROTARY_ENCODER) {  /* select currently configured input method */
  webpage +="<option value='0' selected >Rotary Encoder </option> <option value='1'> Push Buttons </option>";
  } else {
  webpage +="<option value='0'>Rotary Encoder </option> <option value='1' selected > Push Buttons </option>";
  }
  webpage +="</select>&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";
  /* Change sensor */
  webpage +="<p><b>Change Sensor</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<select name='Sensor'> ";
  if (myConfig.sensor == cDHT22) {  /* select currently configured input method */
  webpage +="<option value='0' selected >DHT22 </option> <option value='1'> BME280 </option>";
  } else {
  webpage +="<option value='0'>DHT22 </option> <option value='1' selected > BME280 </option>";
  }
  webpage +="</select>&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";
  /* Restart Device */
  webpage +="<p><b>Restart Device</b></p>";
  if (systemRestartRequest == false) {
    webpage +="<button onclick=\"window.location.href='/restart'\"> Restart </button>";
  } else {
    webpage +="<button onclick=\"window.location.href='/'\"> Restarting, reload site </button>";
  }
  webpage +="</body>\n";
  webpage +="</html>\n";

  webServer.send(200, "text/html", webpage);  /* Send a response to the client asking for input */

  /* Evaluate Received Arguments */
  if (webServer.args() > 0) {  /* Arguments were received */
    for ( uint8_t i = 0; i < webServer.args(); i++ ) {
      #ifdef CFG_DEBUG
      Serial.println("HTTP arg(" + String(i) + "): " + webServer.argName(i) + " = " + webServer.arg(i));  /* Display each argument */
      #endif /* CFG_DEBUG */

      if (webServer.argName(i) == "newName") {  /* check for dedicated arguments */
        if (webServer.arg(i) != myConfig.name) {  /* change name if it differs from the current one */
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write with restart.");
          #endif
          strlcpy(myConfig.name, webServer.arg(i).c_str(), sizeof(myConfig.name));
          requestSaveToSpiffsWithRestart = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
      if (webServer.argName(i) == "InputMethod") {  /* check for dedicated arguments */
        if (webServer.arg(i) != String(myConfig.inputMethod) && (webServer.arg(i).toInt() >= 0) && (webServer.arg(i).toInt() < 2)) { /* check range and if changed at all */
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write with restart.");
          #endif
          myConfig.inputMethod = boolean(webServer.arg(i).toInt());
          requestSaveToSpiffsWithRestart = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
      if (webServer.argName(i) == "Sensor") {  /* check for dedicated arguments */
        if (webServer.arg(i) != String(myConfig.sensor) && (webServer.arg(i).toInt() >= 0) && (webServer.arg(i).toInt() < 2)) { /* check range and if changed at all */
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write with restart.");
          #endif
          myConfig.sensor = webServer.arg(i).toInt();
          requestSaveToSpiffsWithRestart = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
      if (webServer.argName(i) == "updServer") {  /* check for dedicated arguments */
        if (webServer.arg(i) != myConfig.updServer) {
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write.");
          #endif
          strlcpy(myConfig.updServer, webServer.arg(i).c_str(), sizeof(myConfig.updServer));
          requestSaveToSpiffs = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
    }
  }
}

void handleHttpReset(void) {
  systemRestartRequest = true;
  handleWebServerClient();
}

/* MQTT callback if a message was received */
#if CFG_MQTT_LIB == cArduinoMQTT
void messageReceived(String &topic, String &payload) { //NOLINT
#else
void messageReceived(char* c_topic, byte* data, unsigned int data_len) {
  char dataBuf[data_len+1];  // NOLINT: no need to allocate more buffer than necessary
  memcpy(dataBuf, data, data_len);
  dataBuf[sizeof(dataBuf)-1] = 0;
  String payload = String(dataBuf);
  String topic = String(c_topic);
#endif

  #ifdef CFG_DEBUG
  Serial.println("received: " + topic + " : " + payload);
  #endif

